#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`failure`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.k8scluster.local_file.ca_cert will be created
  + resource "local_file" "ca_cert" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "ca-key.pem"
      + id                   = (known after apply)
    }

  # module.k8scluster.local_file.ca_key will be created
  + resource "local_file" "ca_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "ca-key.pem"
      + id                   = (known after apply)
    }

  # module.k8scluster.tls_cert_request.admin will be created
  + resource "tls_cert_request" "admin" {
      + cert_request_pem = (known after apply)
      + id               = (known after apply)
      + key_algorithm    = (known after apply)
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name  = "admin"
          + organization = "system:masters"
        }
    }

  # module.k8scluster.tls_cert_request.csr will be created
  + resource "tls_cert_request" "csr" {
      + cert_request_pem = (known after apply)
      + id               = (known after apply)
      + key_algorithm    = (known after apply)
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name  = "Kubernetes"
          + organization = "Kubernetes"
        }
    }

  # module.k8scluster.tls_cert_request.kube-controller-manager will be created
  + resource "tls_cert_request" "kube-controller-manager" {
      + cert_request_pem = (known after apply)
      + id               = (known after apply)
      + key_algorithm    = (known after apply)
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name         = "Kubernetes"
          + organization        = "system:kube-controller-manager"
          + organizational_unit = "Kubernetes Cluster"
        }
    }

  # module.k8scluster.tls_cert_request.kube-proxy will be created
  + resource "tls_cert_request" "kube-proxy" {
      + cert_request_pem = (known after apply)
      + id               = (known after apply)
      + key_algorithm    = (known after apply)
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name         = "Kubernetes"
          + organization        = "system:node-proxier"
          + organizational_unit = "Kubernetes Cluster"
        }
    }

  # module.k8scluster.tls_cert_request.kube-scheduler will be created
  + resource "tls_cert_request" "kube-scheduler" {
      + cert_request_pem = (known after apply)
      + id               = (known after apply)
      + key_algorithm    = (known after apply)
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name         = "Kubernetes"
          + organization        = "system:kube-scheduler"
          + organizational_unit = "Kubernetes Cluster"
        }
    }

  # module.k8scluster.tls_cert_request.service-accounts will be created
  + resource "tls_cert_request" "service-accounts" {
      + cert_request_pem = (known after apply)
      + id               = (known after apply)
      + key_algorithm    = (known after apply)
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name         = "Kubernetes"
          + organization        = "system:service-accounts"
          + organizational_unit = "Kubernetes Cluster"
        }
    }

  # module.k8scluster.tls_private_key.ca will be created
  + resource "tls_private_key" "ca" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.k8scluster.tls_private_key.ssh will be created
  + resource "tls_private_key" "ssh" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.k8scluster.tls_self_signed_cert.ca will be created
  + resource "tls_self_signed_cert" "ca" {
      + allowed_uses          = [
          + "cert_signing",
          + "crl_signing",
          + "key_encipherment",
          + "client_auth",
          + "server_auth",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = false
      + key_algorithm         = (known after apply)
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = false
      + set_authority_key_id  = false
      + set_subject_key_id    = false
      + validity_end_time     = (known after apply)
      + validity_period_hours = 87600
      + validity_start_time   = (known after apply)

      + subject {
          + common_name  = "My Certificate Authority"
          + organization = "My Organization"
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ssh_private_key = (sensitive value)

```

</details>

*Pushed by: @bkielbasa, Action: `pull_request`*